Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.3.56/samd20b/edc/ATSAMD20E16BU.PIC
      <edc:SFRDef edc:_addr="0x41004437" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing Even" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing Odd" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004438" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX8" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing Even" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing Odd" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004439" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX9" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing Even" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing Odd" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100443A" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX10" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing Even" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing Odd" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100443B" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX11" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing Even" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing Odd" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100443C" edc:access="nnnnnnnn" edc:cname="GROUP0PMUX12" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing Even" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing Odd" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Peripheral function A selected" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Peripheral function B selected" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Peripheral function C selected" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Peripheral function D selected" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="E" edc:desc="Peripheral function E selected" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="F" edc:desc="Peripheral function F selected" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="G" edc:desc="Peripheral function G selected" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="H" edc:desc="Peripheral function H selected" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
